app/Controllers/Mahasiswa.php

    public function index()
    {
        $mahasiswaModel = new \App\Models\mahasiswaModel();
        $mahasiswa = $mahasiswaModel->findAll();
---
SELECT *
FROM `mahasiswa`

    public function create()
    {
        helper('form');

        if ($this->request->getMethod() == 'post') {
            $mahasiswa = [
                'nama' => $this->request->getPost('nama'),
                'nim' => $this->request->getPost('nim'),
                'alamat' => $this->request->getPost('alamat'),
                'telepon' => $this->request->getPost('telepon'),
            ];

            $mahasiswaModel = new \App\Models\mahasiswaModel();
            if ($mahasiswaModel->insert($mahasiswa)) {
---
INSERT INTO `mahasiswa` (`nama`, `nim`, `alamat`, `telepon`) VALUES ('Fahmi', '1234567890', 'Jakarta', '-')

    public function update($id)
    {
        helper('form');

        $mahasiswaModel = new \App\Models\mahasiswaModel();
        $mahasiswa = $mahasiswaModel->find($id);
---
SELECT *
FROM `mahasiswa`
WHERE `mahasiswa`.`id` = '1'

    public function delete($id)
    {
        helper('form');

        $mahasiswaModel = new \App\Models\mahasiswaModel();
        if ($mahasiswaModel->delete($id)) {
---
DELETE FROM `mahasiswa`
WHERE `id` IN ('3')